CREATE DATABASE  IF NOT EXISTS `messenger` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci */ /*!80016 DEFAULT ENCRYPTION='N' */;
USE `messenger`;
-- MySQL dump 10.13  Distrib 8.0.36, for Linux (x86_64)
--
-- Host: 127.0.0.1    Database: messenger
-- ------------------------------------------------------
-- Server version	8.0.36-0ubuntu0.22.04.1

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `Clients`
--

DROP TABLE IF EXISTS `Clients`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `Clients` (
  `id` int NOT NULL AUTO_INCREMENT,
  `activeStatus` tinyint DEFAULT NULL,
  `name` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=13 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `Clients`
--

LOCK TABLES `Clients` WRITE;
/*!40000 ALTER TABLE `Clients` DISABLE KEYS */;
INSERT INTO `Clients` VALUES (1,0,'Ілля'),(2,0,'Денис'),(3,0,'Дмитро'),(4,0,'Андрій'),(8,0,'Віктор'),(12,0,'Арсен');
/*!40000 ALTER TABLE `Clients` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `History`
--

DROP TABLE IF EXISTS `History`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `History` (
  `id` int NOT NULL AUTO_INCREMENT,
  `date` datetime(6) DEFAULT NULL,
  `fileType` tinyint DEFAULT NULL,
  `imageArray` tinyblob,
  `imageName` varchar(255) DEFAULT NULL,
  `imageSize` int NOT NULL,
  `imageType` varchar(255) DEFAULT NULL,
  `message` varchar(255) DEFAULT NULL,
  `recipientName` varchar(255) DEFAULT NULL,
  `senderName` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=137 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `History`
--

LOCK TABLES `History` WRITE;
/*!40000 ALTER TABLE `History` DISABLE KEYS */;
INSERT INTO `History` VALUES (1,'2024-04-20 21:04:40.424000',0,NULL,NULL,0,NULL,'Приіт','Ілля','Денис'),(2,'2024-04-20 21:10:58.605000',0,NULL,NULL,0,NULL,'приіт','Денис','Ілля'),(3,'2024-04-20 21:16:46.056000',0,NULL,NULL,0,NULL,'приіт','Денис','Ілля'),(4,'2024-04-21 11:36:11.664000',0,NULL,NULL,0,NULL,'привіти','Ілля','Денис'),(5,'2024-04-21 11:37:10.164000',0,NULL,NULL,0,NULL,'привітик','Ілля','Денис'),(6,'2024-04-21 11:37:19.324000',0,NULL,NULL,0,NULL,'гигигигигиигигигигигигигигигиггигигиг','Денис','Ілля'),(7,'2024-04-21 11:37:59.572000',0,NULL,NULL,0,NULL,'омагад це шо таке ваше я ен розумію це мать його праграма яка тіпа мессенжер і вже майже вміє передавати фотографії я вшокке просто як це взагалі можливо я не розумію','Денис','Ілля'),(8,'2024-04-21 11:39:13.284000',0,NULL,NULL,0,NULL,'я вшоке це неможливо воно майже працюює ','Ілля','Денис'),(9,'2024-04-21 12:06:47.672000',0,NULL,NULL,0,NULL,'уарп','Денис','Ілля'),(10,'2024-04-21 12:06:58.696000',0,NULL,NULL,0,NULL,'ва','Ілля','Денис'),(11,'2024-04-21 12:07:02.476000',0,NULL,NULL,0,NULL,'чо','Денис','Ілля'),(12,'2024-04-21 12:07:12.668000',0,NULL,NULL,0,NULL,'супер','Ілля','Денис'),(13,'2024-04-21 12:11:35.180000',0,NULL,NULL,0,NULL,'приві','Денис','Ілля'),(14,'2024-04-21 12:11:38.076000',0,NULL,NULL,0,NULL,'привіт','Ілля','Денис'),(15,'2024-04-21 12:12:22.672000',0,NULL,NULL,0,NULL,'пвпів','Ілля','Денис'),(16,'2024-04-21 12:12:24.804000',0,NULL,NULL,0,NULL,'пвіпі','Денис','Ілля'),(17,'2024-04-21 12:24:26.532000',0,NULL,NULL,0,NULL,'хелоу','Денис','Ілля'),(18,'2024-04-21 12:26:51.724000',0,NULL,NULL,0,NULL,'артемчик краще','Денис','Ілля'),(19,'2024-04-21 16:09:31.361000',0,NULL,NULL,0,NULL,'привіти','Денис','Ілля'),(20,'2024-04-22 21:30:18.048000',0,NULL,NULL,0,NULL,'?','Денис','Ілля'),(21,'2024-04-23 18:45:36.416000',0,NULL,NULL,0,NULL,'привіт','Денис','Ілля'),(22,'2024-04-23 18:45:42.960000',0,NULL,NULL,0,NULL,'Неймовірно','Денис','Ілля'),(23,'2024-04-26 17:02:59.041000',0,NULL,NULL,0,NULL,'лаво','Денис','Ілля'),(24,'2024-04-26 17:03:04.286000',0,NULL,NULL,0,NULL,'авіаіва','Ілля','Денис'),(25,'2024-04-27 19:08:31.596000',0,NULL,NULL,0,NULL,'привіт денис','Денис','Ілля'),(26,'2024-04-27 19:09:30.411000',0,NULL,NULL,0,NULL,'перевірка','Денис','Ілля'),(27,'2024-04-27 20:09:41.331000',0,NULL,NULL,0,NULL,'прпівт','Дмитро','Ілля'),(28,'2024-04-27 20:17:38.208000',0,NULL,NULL,0,NULL,'привіт','Ілля','Денис'),(29,'2024-04-28 13:53:14.736000',0,NULL,NULL,0,NULL,'приівт','Денис','Ілля'),(30,'2024-04-28 13:54:42.703000',0,NULL,NULL,0,NULL,'приіт','Ілля','Денис'),(31,'2024-04-28 13:55:22.419000',0,NULL,NULL,0,NULL,'привіт','Денис','Ілля'),(32,'2024-04-28 13:56:04.256000',0,NULL,NULL,0,NULL,'приівт','Денис','Дмитро'),(33,'2024-04-28 13:56:09.267000',0,NULL,NULL,0,NULL,'приівт','Денис','Дмитро'),(34,'2024-04-28 13:56:53.011000',0,NULL,NULL,0,NULL,'привіт','Ілля','Дмитро'),(35,'2024-04-28 13:57:07.863000',0,NULL,NULL,0,NULL,'ого привіт','Ілля','Дмитро'),(36,'2024-04-28 13:57:40.447000',0,NULL,NULL,0,NULL,'гаддєм','Ілля','Дмитро'),(37,'2024-04-28 13:57:42.743000',0,NULL,NULL,0,NULL,'приіти','Ілля','Дмитро'),(38,'2024-04-28 13:57:47.851000',0,NULL,NULL,0,NULL,'гаддєм','Ілля','Дмитро'),(39,'2024-04-28 13:57:54.551000',0,NULL,NULL,0,NULL,'нейиовірно','Дмитро','Ілля'),(40,'2024-04-28 13:57:57.123000',0,NULL,NULL,0,NULL,'я просто в шоці','Дмитро','Ілля'),(41,'2024-04-28 13:58:03.015000',0,NULL,NULL,0,NULL,'ти шо я не знаю що сказати','Дмитро','Ілля'),(42,'2024-04-28 13:59:10.207000',0,NULL,NULL,0,NULL,'ЦЕ НЕМОЖЛИВО','Ілля','Дмитро'),(43,'2024-04-28 14:18:48.227000',0,NULL,NULL,0,NULL,'приівт','Ілля','Денис'),(44,'2024-04-28 14:18:59.676000',0,NULL,NULL,0,NULL,'неймовірно','Денис','Ілля'),(45,'2024-04-29 13:20:08.313000',0,NULL,NULL,0,NULL,'привіт','Денис','Ілля'),(46,'2024-04-29 13:20:11.744000',0,NULL,NULL,0,NULL,'привіт','Ілля','Денис'),(47,'2024-04-29 13:20:22.183000',0,NULL,NULL,0,NULL,'гаддєм','Ілля','Денис'),(48,'2024-04-29 16:36:36.299000',0,NULL,NULL,0,NULL,'привіт','Денис','Ілля'),(49,'2024-04-29 16:36:44.399000',0,NULL,NULL,0,NULL,'гаддєм шо сі стало','Денис','Ілля'),(50,'2024-04-29 16:37:08.169000',0,NULL,NULL,0,NULL,'why doesn\'t spider wear underpants?','Ілля','Денис'),(51,'2024-04-29 16:45:11.608000',0,NULL,NULL,0,NULL,'hello guy','Денис','Ілля'),(52,'2024-04-29 16:45:17.517000',0,NULL,NULL,0,NULL,'goddamn','Денис','Ілля'),(53,'2024-04-29 21:31:04.653000',0,NULL,NULL,0,NULL,'приівт','Денис','Ілля'),(54,'2024-04-29 21:31:16.521000',0,NULL,NULL,0,NULL,'приівт','Ілля','Денис'),(55,'2024-04-29 21:31:32.112000',0,NULL,NULL,0,NULL,'гаддєм привіт','Денис','Ілля'),(56,'2024-04-29 21:31:41.472000',0,NULL,NULL,0,NULL,'к','Ілля','Денис'),(57,'2024-04-29 21:31:45.367000',0,NULL,NULL,0,NULL,'альо','Денис','Ілля'),(58,'2024-04-29 21:32:31.600000',0,NULL,NULL,0,NULL,'привіт','Ілля','Денис'),(59,'2024-04-29 21:32:35.448000',0,NULL,NULL,0,NULL,'привіт','Денис','Ілля'),(60,'2024-04-29 21:36:32.272000',0,NULL,NULL,0,NULL,'привіт','Денис','Ілля'),(61,'2024-04-29 21:36:34.972000',0,NULL,NULL,0,NULL,'приівт','Ілля','Денис'),(62,'2024-04-29 21:36:46.580000',0,NULL,NULL,0,NULL,'приівт','Ілля','Денис'),(63,'2024-04-29 21:36:49.055000',0,NULL,NULL,0,NULL,'приівт','Денис','Ілля'),(64,'2024-04-29 21:36:52.948000',0,NULL,NULL,0,NULL,'приівт','Ілля','Денис'),(65,'2024-04-29 21:36:54.252000',0,NULL,NULL,0,NULL,'приівт','Ілля','Денис'),(66,'2024-04-29 21:36:55.288000',0,NULL,NULL,0,NULL,'прівитє','Ілля','Денис'),(67,'2024-04-29 21:36:57.763000',0,NULL,NULL,0,NULL,'пірв','Денис','Ілля'),(68,'2024-04-29 21:36:58.124000',0,NULL,NULL,0,NULL,'аів','Денис','Ілля'),(69,'2024-04-29 21:36:58.331000',0,NULL,NULL,0,NULL,'аі','Денис','Ілля'),(70,'2024-04-29 21:36:58.533000',0,NULL,NULL,0,NULL,'','Денис','Ілля'),(71,'2024-04-29 21:36:58.712000',0,NULL,NULL,0,NULL,'іва','Денис','Ілля'),(72,'2024-04-29 21:36:59.431000',0,NULL,NULL,0,NULL,'іва','Денис','Ілля'),(73,'2024-04-29 21:36:59.608000',0,NULL,NULL,0,NULL,'іва','Денис','Ілля'),(74,'2024-04-29 21:36:59.768000',0,NULL,NULL,0,NULL,'іва','Денис','Ілля'),(75,'2024-04-29 21:36:59.901000',0,NULL,NULL,0,NULL,'іва','Денис','Ілля'),(76,'2024-04-29 21:37:03.096000',0,NULL,NULL,0,NULL,'аів','Ілля','Денис'),(77,'2024-04-29 21:37:03.282000',0,NULL,NULL,0,NULL,'аі','Ілля','Денис'),(78,'2024-04-29 21:37:03.438000',0,NULL,NULL,0,NULL,'а','Ілля','Денис'),(79,'2024-04-29 21:37:03.572000',0,NULL,NULL,0,NULL,'а','Ілля','Денис'),(80,'2024-04-29 21:37:03.704000',0,NULL,NULL,0,NULL,'іва','Ілля','Денис'),(81,'2024-04-29 21:37:03.841000',0,NULL,NULL,0,NULL,'іва','Ілля','Денис'),(82,'2024-04-29 21:37:21.120000',0,NULL,NULL,0,NULL,'ів','Ілля','Денис'),(83,'2024-04-29 22:11:30.020000',0,NULL,NULL,0,NULL,'приіт','Денис','Ілля'),(84,'2024-04-29 22:11:34.544000',0,NULL,NULL,0,NULL,'денис','Ілля','Денис'),(85,'2024-04-29 22:11:39.968000',0,NULL,NULL,0,NULL,'гаддєм','Денис','Ілля'),(86,'2024-04-29 22:11:44.060000',0,NULL,NULL,0,NULL,'омагад','Ілля','Денис'),(87,'2024-04-29 22:11:48.451000',0,NULL,NULL,0,NULL,'я в шоке','Денис','Ілля'),(88,'2024-04-29 22:11:56.592000',0,NULL,NULL,0,NULL,'гаддєм','Ілля','Денис'),(89,'2024-04-29 23:14:01.004000',0,NULL,NULL,0,NULL,'оллл','Денис','Ілля'),(90,'2024-04-30 08:57:42.968000',0,NULL,NULL,0,NULL,'ваіваві','Денис','Ілля'),(91,'2024-04-30 08:57:43.237000',0,NULL,NULL,0,NULL,'аві','Денис','Ілля'),(92,'2024-04-30 08:57:43.333000',0,NULL,NULL,0,NULL,'а','Денис','Ілля'),(93,'2024-04-30 08:57:43.494000',0,NULL,NULL,0,NULL,'а','Денис','Ілля'),(94,'2024-04-30 08:57:43.686000',0,NULL,NULL,0,NULL,'ві','Денис','Ілля'),(95,'2024-04-30 08:57:43.838000',0,NULL,NULL,0,NULL,'аві','Денис','Ілля'),(96,'2024-04-30 09:03:45.615000',0,NULL,NULL,0,NULL,'опділвп','Ілля','Денис'),(97,'2024-04-30 09:03:46.534000',0,NULL,NULL,0,NULL,'півпв','Ілля','Денис'),(98,'2024-04-30 09:03:50.757000',0,NULL,NULL,0,NULL,'опдівопі','Денис','Ілля'),(99,'2024-04-30 09:39:07.441000',0,NULL,NULL,0,NULL,'привті','Дмитро','Ілля'),(100,'2024-04-30 09:39:10.891000',0,NULL,NULL,0,NULL,'привті','Ілля','Дмитро'),(101,'2024-04-30 12:03:15.223000',0,NULL,NULL,0,NULL,'гаддєм','Денис','Ілля'),(102,'2024-04-30 12:11:16.940000',0,NULL,NULL,0,NULL,'прів','Ілля','Денис'),(103,'2024-04-30 12:11:17.329000',0,NULL,NULL,0,NULL,'аі','Ілля','Денис'),(104,'2024-04-30 12:11:17.503000',0,NULL,NULL,0,NULL,'ів','Ілля','Денис'),(105,'2024-04-30 12:11:17.649000',0,NULL,NULL,0,NULL,'аві','Ілля','Денис'),(106,'2024-04-30 12:11:17.811000',0,NULL,NULL,0,NULL,'а','Ілля','Денис'),(107,'2024-04-30 12:11:17.987000',0,NULL,NULL,0,NULL,'а','Ілля','Денис'),(108,'2024-04-30 12:11:18.143000',0,NULL,NULL,0,NULL,'','Ілля','Денис'),(109,'2024-04-30 12:11:21.392000',0,NULL,NULL,0,NULL,'па','Денис','Ілля'),(110,'2024-04-30 12:11:21.574000',0,NULL,NULL,0,NULL,'пав','Денис','Ілля'),(111,'2024-04-30 12:11:21.723000',0,NULL,NULL,0,NULL,'пав','Денис','Ілля'),(112,'2024-04-30 12:11:21.882000',0,NULL,NULL,0,NULL,'пав','Денис','Ілля'),(113,'2024-04-30 12:11:22.029000',0,NULL,NULL,0,NULL,'пав','Денис','Ілля'),(114,'2024-04-30 12:11:24.272000',0,NULL,NULL,0,NULL,'п','Денис','Ілля'),(115,'2024-04-30 12:11:25.828000',0,NULL,NULL,0,NULL,'а','Ілля','Денис'),(116,'2024-04-30 12:11:26.329000',0,NULL,NULL,0,NULL,'а','Ілля','Денис'),(117,'2024-04-30 12:11:26.563000',0,NULL,NULL,0,NULL,'а','Ілля','Денис'),(118,'2024-04-30 12:11:26.756000',0,NULL,NULL,0,NULL,'а','Ілля','Денис'),(119,'2024-04-30 12:13:25.423000',0,NULL,NULL,0,NULL,'лоавідлоаівад і','Денис','Ілля'),(120,'2024-04-30 12:23:32.704000',0,NULL,NULL,0,NULL,'адвіл авідоа жвідфлао віждлоа ждвіфл оаждвіл оаждвіф оадві лоаждвіф лоафодаовіфж аофвіж аожвіф даожвіфд лаодф жіва жлвіфа овіфждл оажвіфдоа фжвідлоа жвіфдлоа віфждлоа віф афжвід аовіжф','Денис','Ілля'),(121,'2024-04-30 21:00:41.206000',0,NULL,NULL,0,NULL,'півдлорпжідвлоп','Ілля','Денис'),(122,'2024-04-30 21:00:43.546000',0,NULL,NULL,0,NULL,'пфівпфівп','Денис','Ілля'),(123,'2024-04-30 21:00:45.413000',0,NULL,NULL,0,NULL,'фів','Денис','Ілля'),(124,'2024-04-30 21:01:42.833000',0,NULL,NULL,0,NULL,'Нічого особливого, просто день пройшов як завжди. А у тебе щось цікаве було?','Денис','Ілля'),(125,'2024-04-30 21:01:55.389000',0,NULL,NULL,0,NULL,'Ні, нічого особливого. Можливо, пізніше піду на прогулянку, якщо погода покращиться.','Ілля','Денис'),(126,'2024-04-30 21:02:11.273000',0,NULL,NULL,0,NULL,'Так, гарна ідея! Якщо щось зміниш, дай знати, можливо, й я приєднаюся.','Денис','Ілля'),(127,'2024-04-30 21:02:32.153000',0,NULL,NULL,0,NULL,'Звичайно, буду радий. Що плануєш робити пізніше?','Ілля','Денис'),(128,'2024-04-30 21:03:06.805000',0,NULL,NULL,0,NULL,'Можливо, почитаю книжку або подивлюся фільм. Ще не вирішив точно','Денис','Ілля'),(129,'2024-04-30 21:08:43.637000',0,NULL,NULL,0,NULL,'Привіт!','Денис','Ілля'),(130,'2024-04-30 21:08:50.837000',0,NULL,NULL,0,NULL,'Привіт! Як справи?','Ілля','Денис'),(131,'2024-04-30 21:08:57.249000',0,NULL,NULL,0,NULL,'Добре! У тебе?','Денис','Ілля'),(132,'2024-04-30 21:09:05.369000',0,NULL,NULL,0,NULL,'Теж непогано, трошки зайнятий.','Ілля','Денис'),(133,'2024-04-30 21:09:15.137000',0,NULL,NULL,0,NULL,'Розумію. Вже вдома?','Ілля','Денис'),(134,'2024-04-30 21:09:31.697000',0,NULL,NULL,0,NULL,'Так. Ти?','Денис','Ілля'),(135,'2024-04-30 21:09:39.710000',0,NULL,NULL,0,NULL,'ак. Що нового?','Ілля','Денис'),(136,'2024-04-30 21:09:53.550000',0,NULL,NULL,0,NULL,'Нічого особливого. Можливо, пізніше піду на прогулянку.','Денис','Ілля');
/*!40000 ALTER TABLE `History` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2024-05-01 18:55:18
